#pragma warning disable 0169, 0414
using TemplateLibrary;

/*
帧动画数据结构：带总时长的时间轴。到达某个时间，就切换成某张图

| pic         pic           pic                             pic
|......|......|......|......|......|......|......|......|......|......|......|...

所有动画类型的动作可能具备下列 3 种时间轴数据：碰撞圈，锁定线，速度变化

| cd                        cd
| lp
| speed       speed             speed  speed  speed  speed
|......|......|......|......|......|......|......|......|......|......|......|...

同一个动作含有的时间轴，因为密度不同，数据存储是分离的。它们结构类似，都是 起始时间点 + 状态数据，总时长依赖于动作本身

*/


/*******************************************************************************************/
// 锁定相关
/*******************************************************************************************/

[Struct, Desc("锁定点")]
class LockPoint {
    float x;
    float y;
};

[Struct, Desc("时间点--锁定点线")]
class TimePoint_LockPoints {
    [Desc("起始时间( 秒 )")]
    float time;
    [Desc("主锁定点。如果出屏幕，则锁定 锁定线与屏幕边缘形成的 交点")]
    LockPoint mainLockPoint;
    [Desc("锁定线")]
    List<LockPoint> lockPoints;
};

/*******************************************************************************************/
// 碰撞相关
/*******************************************************************************************/

[Struct, Desc("碰撞圆")]
class CDCircle {
    float x;
    float y;
    float r;
};

[Struct, Desc("时间点--碰撞圆集合")]
class TimePoint_CDCircles {
    [Desc("起始时间( 秒 )")]
    float time;
    [Desc("最大碰撞圆范围（外包围圆），用于碰撞检测粗判")]
    CDCircle maxCDCircle;
    [Desc("具体碰撞圆列表，用于碰撞检测遍历细判")]
    List<CDCircle> cdCircles;
};

/*******************************************************************************************/
// 时间点--速度
/*******************************************************************************************/

[Struct, Desc("时间点--移动速度")]
class TimePoint_Speed {
    [Desc("起始时间( 秒 )")]
    float time;
    [Desc("每秒移动距离(米)")]
    float speed;
};

/*******************************************************************************************/
// 精灵帧
/*******************************************************************************************/

[Struct, Desc("时间点--精灵帧")]
class TimePoint_Frame {
    [Desc("起始时间( 秒 )")]
    float time;
    [Desc("精灵帧名称")]
    string picName;
};

/*******************************************************************************************/
// 基类
/*******************************************************************************************/

[Struct, Desc("动作( 兼容 spine, c3b, frames )")]
class Action {
    [Desc("动作名")]
    string name;
    [Desc("总时长( 秒 )")]
    float totalSeconds;
    [Desc("时间点--锁定点线 集合")]
    List<TimePoint_LockPoints> lps;
    [Desc("时间点--碰撞圆 集合")]
    List<TimePoint_CDCircles> cds;
    [Desc("时间点--速度 集合")]
    List<TimePoint_Speed> ss;
    [Desc("时间点--精灵帧 集合( spine, c3b 时该集合为 0 长 )")]
    List<TimePoint_Frame> fs;
};

[Struct, Desc("动画 配置文件基类")]
class File_Anim {
    [Desc("目标文件名")]
    string fileName;
    [Desc("动作集合")]
    List<Action> actions;
};

/*******************************************************************************************/
// frames
/*******************************************************************************************/

[Struct, Desc("精灵帧动画 配置文件( *.frames )")]
class File_frames : File_Anim {};

/*******************************************************************************************/
// spine
/*******************************************************************************************/

[Struct, Desc("spine 配置文件( *.atlas.ext )")]
class File_atlas_ext : File_Anim {};

/*******************************************************************************************/
// c3b
/*******************************************************************************************/

[Struct, Desc("c3b 配置文件( *.c3b.ext )")]
class File_c3b_ext : File_Anim {};

